In [1]:
import numpy as np
import pandas as pd
import os
import re

## Importing data

In [2]:
os.chdir(r'C:\Users\chitr\gc-march-2022\data')

In [3]:
df_da = pd.read_csv('dice_DataAnalyst_2022.csv')
df_da.head(5)

,Unnamed: 0,title,company,description,location
0,0,Data Analyst,3K Technologies,"Data Analyst Eden Prairie, MN (Remote) 1 Year ...",Remote
1,1,Data Analyst,IDC Technologies,Data Analyst 100% remote Contract Job Descr...,Remote
2,2,Data Analyst,AIMIC Inc.,"Data Analyst Reston, VA (Remote to start but M...",Remote
3,3,Data Analyst,Vaco Technology,Job Title: Data Analyst Location: New York/ R...,"New York, NY, USA"
4,4,Data Analyst,Nivid InfoTech Inc.,"Data Analyst Atlanta, GA ( Remote to start ) ...","Remote or Atlanta, GA, USA"

In [4]:
df_da.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 921 entries, 0 to 920
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   921 non-null    int64
 1   title        921 non-null    object
 2   company      921 non-null    object
 3   description  921 non-null    object
 4   location     921 non-null    object
dtypes: int64(1), object(4)
memory usage: 36.1+ KB

In [5]:
df_de = pd.read_csv('dice_DataEngineer_2022.csv')

In [6]:
df_de.head(5)

,Unnamed: 0,title,company,description,location
0,0,Data Engineer 3 (Technical),"Northwest Permanente, PC",The Data Engineer 3 position provides the oppo...,"Portland, OR, USA"
1,1,Data & Automation Engineer,"ClearBridge Investments, LLC",ClearBridge Investments is a leading global eq...,"New York, NY, USA"
2,2,Data Engineer,The Ascent Services Group,"Title: Data Engineer Location: Denver, CO Ty...","Glendale, CO, USA"
3,3,Data Engineer,"Softpath System, LLC.",Job Details: Job Title : Data Engineer Work L...,"Shawnee, KS, USA"
4,4,Data Engineer,Mastech Digital,Mastech Digital provides digital and mainstrea...,"Remote or Pittsburgh, PA, USA"

In [7]:
df_de.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1992 entries, 0 to 1991
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1992 non-null   int64
 1   title        1992 non-null   object
 2   company      1992 non-null   object
 3   description  1992 non-null   object
 4   location     1992 non-null   object
dtypes: int64(1), object(4)
memory usage: 77.9+ KB

In [8]:
df_ds = pd.read_csv('dice_Datascientist_2022.csv')

In [9]:
df_ds.head()

,Unnamed: 0,title,company,description,location
0,0,Data Science Architect,Randstad Technologies,job summary: The Data Science Architect works...,"North Chicago, IL, USA"
1,1,Data Science Trainee,HStechnologies LLC,"HS Technologies, is an Equal Opportunity Emplo...",Remote
2,2,Data Science,Ventures Unlimited,"Position:- Data Science , Location:- Austin,...","Austin, TX, USA"
3,3,Urgent Opening | Product Manager Data Science...,SunRay Enterprise Inc,"Hi All,Hope you are doing well! Please see th...",Remote
4,4,Project Manager (With Data Science Experience ),WB Solutions LLC,Greetings from WB Solutions! We have the Urg...,"Santa Clara, CA, USA"

In [10]:
df_ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1990 entries, 0 to 1989
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1990 non-null   int64
 1   title        1990 non-null   object
 2   company      1990 non-null   object
 3   description  1990 non-null   object
 4   location     1990 non-null   object
dtypes: int64(1), object(4)
memory usage: 77.9+ KB

None of the columns from all three files contains null value.

## Data cleaning

###  Checking and dropping any duplicate rows

In [11]:
df_da = df_da.drop_duplicates()
df_da.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 921 entries, 0 to 920
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   921 non-null    int64
 1   title        921 non-null    object
 2   company      921 non-null    object
 3   description  921 non-null    object
 4   location     921 non-null    object
dtypes: int64(1), object(4)
memory usage: 43.2+ KB

In [12]:
df_de = df_de.drop_duplicates()
df_de.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1992 entries, 0 to 1991
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   1992 non-null   int64
 1   title        1992 non-null   object
 2   company      1992 non-null   object
 3   description  1992 non-null   object
 4   location     1992 non-null   object
dtypes: int64(1), object(4)
memory usage: 93.4+ KB

In [13]:
df_ds= df_ds.drop(columns=['Unnamed: 0'])
df_ds = df_ds.drop_duplicates()
df_ds.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1561 entries, 0 to 1987
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        1561 non-null   object
 1   company      1561 non-null   object
 2   description  1561 non-null   object
 3   location     1561 non-null   object
dtypes: object(4)
memory usage: 61.0+ KB

#### Merging all the data into one dataframe

In [14]:
df_dice = pd.concat([df_da,df_de,df_ds])
df_dice.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4474 entries, 0 to 1987
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   2913 non-null   float64
 1   title        4474 non-null   object
 2   company      4474 non-null   object
 3   description  4474 non-null   object
 4   location     4474 non-null   object
dtypes: float64(1), object(4)
memory usage: 209.7+ KB

In [15]:
df_dice.head()

,Unnamed: 0,title,company,description,location
0,0.0,Data Analyst,3K Technologies,"Data Analyst Eden Prairie, MN (Remote) 1 Year ...",Remote
1,1.0,Data Analyst,IDC Technologies,Data Analyst 100% remote Contract Job Descr...,Remote
2,2.0,Data Analyst,AIMIC Inc.,"Data Analyst Reston, VA (Remote to start but M...",Remote
3,3.0,Data Analyst,Vaco Technology,Job Title: Data Analyst Location: New York/ R...,"New York, NY, USA"
4,4.0,Data Analyst,Nivid InfoTech Inc.,"Data Analyst Atlanta, GA ( Remote to start ) ...","Remote or Atlanta, GA, USA"

In [16]:
df_dice.tail()

,Unnamed: 0,title,company,description,location
1982,NaN,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Louisville, CO, USA"
1983,NaN,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Arvada, CO, USA"
1984,NaN,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Parker, CO, USA"
1985,NaN,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Idledale, CO, USA"
1987,NaN,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Westminster, CA, USA"

In [17]:
df_dice= df_dice.drop(columns=['Unnamed: 0'])
df_dice = df_dice.drop_duplicates(ignore_index=True)
df_dice.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3917 entries, 0 to 3916
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   title        3917 non-null   object
 1   company      3917 non-null   object
 2   description  3917 non-null   object
 3   location     3917 non-null   object
dtypes: object(4)
memory usage: 122.5+ KB

In [18]:
df_dice.tail()

,title,company,description,location
3912,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Louisville, CO, USA"
3913,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Arvada, CO, USA"
3914,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Parker, CO, USA"
3915,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Idledale, CO, USA"
3916,Lead Flight Engineers,BOEING,"Job Description At Boeing, we innovate and co...","Westminster, CA, USA"

##### This dataset does have enough amount of rows to start with initial analysis. But I do see that some job roles and descriptions are same but just change in location created more rows in the dataset. That needs to be investigated more.

In [19]:
df_dice['title'] = df_dice['title'].str.lower()
df_dice['company'] = df_dice['company'].str.lower()
df_dice['description'] = df_dice['description'].str.lower()
df_dice['location'] = df_dice['location'].str.lower()

In [20]:
df_dice

,title,company,description,location
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",remote
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,remote
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",remote
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"new york, ny, usa"
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","remote or atlanta, ga, usa"
...,...,...,...,...
3912,lead flight engineers,boeing,"job description at boeing, we innovate and co...","louisville, co, usa"
3913,lead flight engineers,boeing,"job description at boeing, we innovate and co...","arvada, co, usa"
3914,lead flight engineers,boeing,"job description at boeing, we innovate and co...","parker, co, usa"
3915,lead flight engineers,boeing,"job description at boeing, we innovate and co...","idledale, co, usa"
3916,lead flight engineers,boeing,"job description at boeing, we innovate and co...","westminster, ca, usa"

In [21]:
df_dice['location'].value_counts()

 remote                        638
 new york, ny, usa             154
 los angeles, ca, usa          120
 chicago, il, usa               66
 atlanta, ga, usa               66
                              ...
 urbandale, ia, usa              1
 remote or vienna, va, usa       1
 east moline, il, usa            1
 gurugram, hr, india             1
 idledale, co, usa               1
Name: location, Length: 888, dtype: int64

##### Remote seems to be the most occurring keyword. Also, there are some companies giving options for remote as well as in-person. So to analyze how many in total remote jobs let's create one more column is_remote.

In [22]:
import numpy as np

df_dice['is_remote'] = np.where(df_dice['location'].str.contains('remote'),1,0)
df_dice

,title,company,description,location,is_remote
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",remote,1
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,remote,1
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",remote,1
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"new york, ny, usa",0
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","remote or atlanta, ga, usa",1
...,...,...,...,...,...
3912,lead flight engineers,boeing,"job description at boeing, we innovate and co...","louisville, co, usa",0
3913,lead flight engineers,boeing,"job description at boeing, we innovate and co...","arvada, co, usa",0
3914,lead flight engineers,boeing,"job description at boeing, we innovate and co...","parker, co, usa",0
3915,lead flight engineers,boeing,"job description at boeing, we innovate and co...","idledale, co, usa",0
3916,lead flight engineers,boeing,"job description at boeing, we innovate and co...","westminster, ca, usa",0

##### Lets split 'location' column into create more columns, 'city', 'state' and 'country', to further analyze jobs by state or city.

In [23]:
df_dice['location'] = df_dice['location'].str.replace('d.c.', 'dc')
df_dice['location'] = df_dice['location'].str.strip()
df_dice['location'] = df_dice['location'].str.split(',')

C:\Users\chitr\AppData\Local\Temp\ipykernel_7904\2435904984.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df_dice['location'] = df_dice['location'].str.replace('d.c.', 'dc')

In [24]:
df_dice['city'] = df_dice['location'].str[0]
df_dice['state'] = df_dice['location'].str[1]
df_dice['country'] = df_dice['location'].str[2]

In [25]:
df_dice

,title,company,description,location,is_remote,city,state,country
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",[remote],1,remote,NaN,NaN
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,[remote],1,remote,NaN,NaN
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",[remote],1,remote,NaN,NaN
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"[new york, ny, usa]",0,new york,ny,usa
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","[remote or atlanta, ga, usa]",1,remote or atlanta,ga,usa
...,...,...,...,...,...,...,...,...
3912,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[louisville, co, usa]",0,louisville,co,usa
3913,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[arvada, co, usa]",0,arvada,co,usa
3914,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[parker, co, usa]",0,parker,co,usa
3915,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[idledale, co, usa]",0,idledale,co,usa
3916,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[westminster, ca, usa]",0,westminster,ca,usa

In [26]:
df_dice['city'] = df_dice['city'].str.replace('remote', '')
df_dice['city'] = df_dice['city'].str.replace('remote or  ', '')
df_dice['city'] = df_dice['city'].str.replace(' or ', '')

In [27]:
df_dice

,title,company,description,location,is_remote,city,state,country
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",[remote],1,,NaN,NaN
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,[remote],1,,NaN,NaN
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",[remote],1,,NaN,NaN
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"[new york, ny, usa]",0,new york,ny,usa
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","[remote or atlanta, ga, usa]",1,atlanta,ga,usa
...,...,...,...,...,...,...,...,...
3912,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[louisville, co, usa]",0,louisville,co,usa
3913,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[arvada, co, usa]",0,arvada,co,usa
3914,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[parker, co, usa]",0,parker,co,usa
3915,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[idledale, co, usa]",0,idledale,co,usa
3916,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[westminster, ca, usa]",0,westminster,ca,usa

In [28]:
df_dice.country.value_counts()
#df_dice[df_dice['state'].str.contains('dc', na=False)]

 usa       3158
 dc          45
 canada       9
 mexico       1
 india        1
Name: country, dtype: int64

In [29]:
df_dice.drop(index = [878,1175,2268,2824,2999,511,628,338,947,1743,3041,2076], axis=0,inplace = True)

In [30]:
df_dice.country.value_counts()

 usa    3158
 dc       45
Name: country, dtype: int64

In [31]:
df_dice['country'] = df_dice['country'].str.replace('DC', 'USA')
df_dice.country.value_counts()

 usa    3158
 dc       45
Name: country, dtype: int64

In [32]:
df_dice['job_type'] = np.where(df_dice['title'].str.contains('analy'),'Data Analyst','0')
df_dice['job_type'] = np.where(df_dice['title'].str.contains('engineer'),'Data Engineer',df_dice['job_type'])
df_dice['job_type'] = np.where(df_dice['title'].str.contains('scien'),'Data Scientist',df_dice['job_type'])
df_dice['job_type'] = np.where(df_dice['job_type'] == '0','Other',df_dice['job_type'])
df_dice

,title,company,description,location,is_remote,city,state,country,job_type
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",[remote],1,,NaN,NaN,Data Analyst
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,[remote],1,,NaN,NaN,Data Analyst
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",[remote],1,,NaN,NaN,Data Analyst
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"[new york, ny, usa]",0,new york,ny,usa,Data Analyst
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","[remote or atlanta, ga, usa]",1,atlanta,ga,usa,Data Analyst
...,...,...,...,...,...,...,...,...,...
3912,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[louisville, co, usa]",0,louisville,co,usa,Data Engineer
3913,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[arvada, co, usa]",0,arvada,co,usa,Data Engineer
3914,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[parker, co, usa]",0,parker,co,usa,Data Engineer
3915,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[idledale, co, usa]",0,idledale,co,usa,Data Engineer
3916,lead flight engineers,boeing,"job description at boeing, we innovate and co...","[westminster, ca, usa]",0,westminster,ca,usa,Data Engineer

In [33]:
employmenttypes = [ 'full time','part time', 'contract', 'long term', '6 months', '12 months']

df_dice['employment_type'] = np.nan

for ind in df_dice.index:
    desc=df_dice['description'][ind]
 
    desc = re.sub("[^a-zA-Z0-12]",  # Search for all non-letters
                          " ",          # Replace all non-letters with spaces
                          str(desc))
    lst = ''
    for emptype in employmenttypes:
        if  re.search(emptype,desc):
            lst=lst+emptype+','
    lst = lst[:-1]
   
    if ind < len(df_dice):
        df_dice['employment_type'].iloc[ind]=lst

df_dice.head(10)

C:\Users\chitr\AppData\Local\Temp\ipykernel_7904\1788771951.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_dice['employment_type'].iloc[ind]=lst

,title,company,description,location,is_remote,city,state,country,job_type,employment_type
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",[remote],1,,NaN,NaN,Data Analyst,
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,[remote],1,,NaN,NaN,Data Analyst,contract
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",[remote],1,,NaN,NaN,Data Analyst,
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"[new york, ny, usa]",0,new york,ny,usa,Data Analyst,
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","[remote or atlanta, ga, usa]",1,atlanta,ga,usa,Data Analyst,long term
5,data analyst,bcforward,data analyst bcforward is currently seeking a ...,"[new york, ny, usa]",0,new york,ny,usa,Data Analyst,"contract,12 months"
6,data analyst,kabtec,greetings! hope you are doing great today!! ...,"[pleasant prairie, wi, usa]",0,pleasant prairie,wi,usa,Data Analyst,contract
7,data analyst,randstad technologies,job summary: the primary purpose of this job ...,"[tampa, fl, usa]",0,tampa,fl,usa,Data Analyst,
8,data analyst,sira consulting,"job title: data analyst location: natick, ma ...",[remote],1,,NaN,NaN,Data Analyst,
9,data analyst,compugain llc,description:data analyst: the candidate will w...,[],0,,NaN,NaN,Data Analyst,

In [34]:
df_dice.employment_type.value_counts()

                                3084
contract                         308
full time                        244
long term                         84
contract,long term                82
12 months                         44
contract,12 months                24
full time,contract                12
contract,long term,12 months       4
full time,contract,long term       3
full time,part time                2
full time,long term                2
Name: employment_type, dtype: int64

In [35]:
experience_levels = ['associate','senior','intern','principal',
                  'director','leader','manager','specialist','entry level','machine learning'
                    ,'junior','jr','sr']

df_dice['experience_level'] = np.nan
for index,level in enumerate(experience_levels):
    df_dice['experience_level'] = np.where(df_dice['description'].str.contains(level),level,df_dice['experience_level'])

In [36]:
df_dice.experience_level.value_counts()

nan                 2526
senior               334
sr                   261
leader               234
machine learning     163
manager              124
intern                82
director              51
associate             45
specialist            28
principal             24
junior                20
jr                     9
entry level            4
Name: experience_level, dtype: int64

In [37]:
df_dice['experience_level'] =df_dice['experience_level'].str.replace('sr','senior')
df_dice['experience_level'] =df_dice['experience_level'].str.replace('jr','junior')

In [38]:
df_dice.experience_level.value_counts()

nan                 2526
senior               595
leader               234
machine learning     163
manager              124
intern                82
director              51
associate             45
junior                29
specialist            28
principal             24
entry level            4
Name: experience_level, dtype: int64

In [39]:
skills=['python','java','sql','spark','hadoop','bigdata','machine learning','hive','pig','git','nosql','aws','azure', 'power bi', 'tableau','etl','agile','relational databases','postgres','matlab','graphql','data analysis','excel','data modeling','shell scripting','gcp','cloud computing','deep learning','nlp','flask','eda']

df_dice['skills'] = np.nan

for ind in df_dice.index:
    desc=df_dice['description'][ind]
 
    desc = re.sub("[^a-zA-Z]",  # Search for all non-letters
                          " ",          # Replace all non-letters with spaces
                          str(desc))
    lst = ''
    for skill in skills:
        if  re.search(skill,desc):
            lst=lst+skill+','
    lst = lst[:-1]
   
    if ind < len(df_dice):
        df_dice['skills'].iloc[ind]=lst

df_dice.head(10)

C:\Users\chitr\AppData\Local\Temp\ipykernel_7904\2869466735.py:18: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_dice['skills'].iloc[ind]=lst

,title,company,description,location,is_remote,city,state,country,job_type,employment_type,experience_level,skills
0,data analyst,3k technologies,"data analyst eden prairie, mn (remote) 1 year ...",[remote],1,,NaN,NaN,Data Analyst,,senior,"sql,power bi"
1,data analyst,idc technologies,data analyst 100% remote contract job descr...,[remote],1,,NaN,NaN,Data Analyst,contract,nan,
2,data analyst,aimic inc.,"data analyst reston, va (remote to start but m...",[remote],1,,NaN,NaN,Data Analyst,,nan,
3,data analyst,vaco technology,job title: data analyst location: new york/ r...,"[new york, ny, usa]",0,new york,ny,usa,Data Analyst,,nan,
4,data analyst,nivid infotech inc.,"data analyst atlanta, ga ( remote to start ) ...","[remote or atlanta, ga, usa]",1,atlanta,ga,usa,Data Analyst,long term,nan,sql
5,data analyst,bcforward,data analyst bcforward is currently seeking a ...,"[new york, ny, usa]",0,new york,ny,usa,Data Analyst,"contract,12 months",senior,
6,data analyst,kabtec,greetings! hope you are doing great today!! ...,"[pleasant prairie, wi, usa]",0,pleasant prairie,wi,usa,Data Analyst,contract,nan,
7,data analyst,randstad technologies,job summary: the primary purpose of this job ...,"[tampa, fl, usa]",0,tampa,fl,usa,Data Analyst,,nan,
8,data analyst,sira consulting,"job title: data analyst location: natick, ma ...",[remote],1,,NaN,NaN,Data Analyst,,nan,"sql,data modeling"
9,data analyst,compugain llc,description:data analyst: the candidate will w...,[],0,,NaN,NaN,Data Analyst,,nan,

In [40]:
df_dice['state'] = df_dice['state'].str.strip()
df_dice['city'] = df_dice['city'].str.strip()

In [41]:
df_dice.to_csv(r'C:\Users\chitr\gc-march-2022\DiceCleanedData.csv', index=False)